#+TITLE: How to use Maud
#+STARTUP: overview

This document explains how to use [[https://github.com/biosustain/Maud/][Maud]] to fit Bayesian statistical models of
steady-state metabolic networks.

** An example Maud input

To start with, this section goes through the files in the example dataset we
have provided. You can find a discussion of the input data format in Maud's
documentation [[https://maud-metabolic-models.readthedocs.io/en/latest/usage/inputting.html][here]], but this guide should be enough to get started.

First let's check out the contents of the example folder, which should look
roughly as follows:

#+begin_src sh :results drawer
  ls data/example_maud_input
#+end_src

#+RESULTS:
:results:
readme.md
:end:

The most important of these files, and the only one whose name is important, is
~config.toml~. This file tells Maud where to look for the other files it needs,
and stores some configuration information that is passed on to Stan. Here is
what our example config file looks like:

#+begin_src sh
  cat data/example_maud_input/config.toml
#+end_src


#+begin_src sh :results drawer
  cat data/example_maud_input/kinetic_model.toml
#+end_src

#+RESULTS:
:results:
:end:

